window["school-calendars"].push({
    名称: 2027,
    开始于: "2027-9-11", // 这一天是今年暑假的第一天，必须是周日。这个日期在上一年的暑假里找
    结束于: "2028-7-12", // 这一天是第三学期结束的最后一天
    
    节假日: {
    }
});

window["school-calendars"].push({
    名称: 2026,
    开始于: "2026-9-6", // 这一天是今年暑假的第一天，必须是周日。这个日期在上一年的暑假里找
    结束于: "2027-7-3", // 这一天是第三学期结束的最后一天
    第一学期: {
        开始于: "2026-9-6", // 这一天必须是周日
        结束于: "2027-1-9",
        期末考: {
            开始于: "2026-12-27", // 这一天必须是周日
            结束于: "2027-1-9"
        }
    },
    寒假: {
        开始于: "2027-1-10", // 这一天必须是周日
        结束于: "2027-2-13"
    },
    第二学期: {
        开始于: "2027-2-14", // 这一天必须是周日
        结束于: "2027-6-12",
        期末考: {
            开始于: "2027-5-30", // 这一天必须是周日
            结束于: "2027-6-12"
        }
    },
    第三学期: {
        开始于: "2027-6-13", // 这一天必须是周日
        结束于: "2027-7-3" // 这一天也是本年的最后一天
    },
    暑假: {
        开始于: "2027-7-4", // 这一天必须是周日，配置这个的同时，也配置下一年开始的那一天
        结束于: "2027-8-31"
    },
    
    节假日: {
        元旦: {
            开始于: "2026-1-1",
            结束于: "2026-1-3",
            调休: [
                '2026-1-4',
            ]
        },
        春节: {
            开始于: "2026-2-15",
            结束于: "2026-2-23",
            调休: [
                '2026-2-14',
                '2026-2-28',
            ]
        },
        清明节: {
            开始于: "2026-4-4",
            结束于: "2026-4-6"
        },
        劳动节: {
            开始于: "2026-5-1",
            结束于: "2026-5-5",
            调休: [
                '2026-5-9'
            ]
        },
        端午节: {
            开始于: "2026-6-19",
            结束于: "2026-6-21",
        },
        中秋节: {
            开始于: "2026-9-25",
            结束于: "2026-9-27",
            调休: [
                '2026-9-20',
            ]
        },
        国庆节: {
            开始于: "2026-10-1",
            结束于: "2026-10-7",
            调休: [
                '2026-10-10'
            ]
        },
    }
});

window["school-calendars"].push({
    名称: 2025,
    开始于: "2025-7-19", // 这一天是今年暑假的第一天，必须是周日。这个日期在上一年的暑假里找
    结束于: "2026-7-18", // 这一天是第三学期结束的最后一天
    第一学期: {
        开始于: "2025-8-31", // 这一天必须是周日
        结束于: "2026-1-10",
        期末考: {
            开始于: "2025-12-28", // 这一天必须是周日
            结束于: "2026-1-10"
        }
    },
    寒假: {
        开始于: "2026-1-11", // 这一天必须是周日
        结束于: "2026-2-28"
    },
    第二学期: {
        开始于: "2026-3-1", // 这一天必须是周日
        结束于: "2026-6-27",
        期末考: {
            开始于: "2026-6-14", // 这一天必须是周日
            结束于: "2026-6-27"
        }
    },
    第三学期: {
        开始于: "2026-6-28", // 这一天必须是周日
        结束于: "2026-7-18" // 这一天也是本年的最后一天
    },
    暑假: {
        开始于: "2026-7-19", // 这一天必须是周日，配置这个的同时，也配置下一年开始的那一天
        结束于: "2026-9-5"
    },
    节假日: {
        元旦: {
            开始于: "2025-1-1",
            结束于: "2025-1-1",
        },
        春节: {
            开始于: "2025-1-28",
            结束于: "2025-2-4",
            调休: [
                '2025-1-26',
                '2025-2-8'
            ]
        },
        清明节: {
            开始于: "2025-4-4",
            结束于: "2025-4-6"
        },
        劳动节: {
            开始于: "2025-5-1",
            结束于: "2025-5-5",
            调休: [
                '2025-4-27'
            ]
        },
        端午节: {
            开始于: "2025-5-31",
            结束于: "2025-6-2",
        },
        国庆节: {
            开始于: "2025-10-1",
            结束于: "2025-10-8",
            调休: [
                '2025-9-28',
                '2025-10-11'
            ]
        },
    }
});
window["school-calendars"].push({
    名称: 2024,
    开始于: "2024-9-1",
    结束于: "2025-7-12",
    第一学期: {
        开始于: "2024-9-1", // 这一天必须是周日
        结束于: "2025-1-11",
        期末考: {
            开始于: "2024-12-29", // 这一天必须是周日
            结束于: "2025-1-11"
        }
    },
    寒假: {
        开始于: "2025-1-12", // 这一天必须是周日
        结束于: "2025-2-15"
    },
    第二学期: {
        开始于: "2025-2-16", // 这一天必须是周日
        结束于: "2025-6-21",
        期末考: {
            开始于: "2025-6-8", // 这一天必须是周日
            结束于: "2025-6-21"
        }
    },
    第三学期: {
        开始于: "2025-6-22", // 这一天必须是周日
        结束于: "2025-7-12"
    },
    暑假: {
        开始于: "2025-7-13", // 这一天必须是周日
        结束于: "2025-8-30"
    },
    节假日: {
        元旦: {
            开始于: "2024-1-1",
            结束于: "2024-1-1",
        },
        春节: {
            开始于: "2024-2-10",
            结束于: "2024-2-17",
            调休: [
                '2024-2-4',
                '2024-2-18'
            ]
        },
        清明节: {
            开始于: "2024-4-4",
            结束于: "2024-4-6",
            调休: [
                '2024-4-7',
            ]
        },
        劳动节: {
            开始于: "2024-5-1",
            结束于: "2024-5-5",
            调休: [
                '2024-4-28',
                '2024-5-11'
            ]
        },
        端午节: {
            开始于: "2024-6-10",
            结束于: "2024-6-10",
        },
        中秋节: {
            开始于: "2024-9-15",
            结束于: "2024-9-17",
            调休: [
                '2024-9-14',
            ]
        },
        国庆节: {
            开始于: "2024-10-1",
            结束于: "2024-10-7",
            调休: [
                '2024-9-29',
                '2024-10-12'
            ]
        },
    }
});
window["school-calendars"].push({
    名称: 2023,
    开始于: "2023-9-10",
    结束于: "2024-8-31",
    第一学期: {
        开始于: "2023-9-10", // 这一天必须是周日
        结束于: "2024-1-13",
        期末考: {
            开始于: "2023-12-31", // 这一天必须是周日
            结束于: "2024-1-14"
        }
    },
    寒假: {
        开始于: "2024-1-14", // 这一天必须是周日
        结束于: "2024-2-24"
    },
    第二学期: {
        开始于: "2024-2-25", // 这一天必须是周日
        结束于: "2024-6-22",
        期末考: {
            开始于: "2024-6-9", // 这一天必须是周日
            结束于: "2024-6-22"
        }
    },
    第三学期: {
        开始于: "2024-6-23", // 这一天必须是周日
        结束于: "2024-7-20"
    },
    暑假: {
        开始于: "2024-7-21", // 这一天必须是周日
        结束于: "2024-8-31"
    },
    节假日: {
        中秋节: {
            开始于: "2023-9-29",
            结束于: "2023-9-29"
        },
        国庆节: {
            开始于: "2023-9-30",
            结束于: "2023-10-6",
            调休: [
                '2023-10-7',
                '2023-10-8'
            ]
        },
    }
});

window["school-calendars"].push({
    名称: 2022,
    开始于: "2022-9-12",
    结束于: "2023-9-9",
    第一学期: {
        开始于: "2022-9-11", // 这一天必须是周日
        结束于: "2023-1-14",
        期末考: {
            开始于: "2023-1-1", // 这一天必须是周日
            结束于: "2023-1-14"
        }
    },
    寒假: {
        开始于: "2023-1-15", // 这一天必须是周日
        结束于: "2023-2-11"
    },
    第二学期: {
        开始于: "2023-2-12", // 这一天必须是周日
        结束于: "2023-7-1",
        期中考: {
            开始于: "2023-4-3", // 这一天必须是周日
            结束于: "2023-4-16"
        },
        期末考: {
            开始于: "2023-6-18", // 这一天必须是周日
            结束于: "2023-7-1"
        }
    },
    第三学期: {
        开始于: "2023-7-2", // 这一天必须是周日
        结束于: "2023-7-29"
    },
    暑假: {
        开始于: "2023-7-30", // 这一天必须是周日
        结束于: "2023-9-9"
    },
    节假日: {
        中秋节: {
            开始于: "2022-9-10",
            结束于: "2022-9-12"
        },
        国庆节: {
            开始于: "2022-10-1",
            结束于: "2022-10-7",
            调休: [
                '2022-10-8',
                '2022-10-9'
            ]
        },
        元旦: {
            开始于: "2022-12-31",
            结束于: "2023-1-2"
        },
        春节: {
            开始于: "2023-1-21",
            结束于: "2023-1-27",
            调休: [
                '2023-1-28',
                '2023-1-29'
            ]
        },
        清明节: {
            开始于: "2023-4-5",
            结束于: "2023-4-5"
        },
        劳动节: {
            开始于: "2023-4-29",
            结束于: "2023-5-3",
            调休: [
                '2023-4-23',
                '2023-5-6'
            ]
        },
        端午节: {
            开始于: "2023-6-22",
            结束于: "2023-6-24",
            调休: [
                '2023-6-25'
            ]
        },
    }
});

window["school-calendars"].push({
    名称: 2021,
    开始于: "2021-9-12",
    结束于: "2022-9-11",
    第一学期: {
        开始于: "2021-9-12", // 这一天必须是周日
        结束于: "2022-1-15",
        期末考: {
            开始于: "2022-1-2", // 这一天必须是周日
            结束于: "2022-2-15"
        }
    },
    寒假: {
        开始于: "2022-1-16", // 这一天必须是周日
        结束于: "2022-2-19"
    },
    第二学期: {
        开始于: "2022-2-20", // 这一天必须是周日
        结束于: "2022-6-18",
        期中考: {
            开始于: "2022-4-3", // 这一天必须是周日
            结束于: "2022-4-16"
        },
        期末考: {
            开始于: "2022-6-5", // 这一天必须是周日
            结束于: "2022-6-18"
        }
    },
    第三学期: {
        开始于: "2022-6-19", // 这一天必须是周日
        结束于: "2022-7-23"
    },
    暑假: {
        开始于: "2022-7-24", // 这一天必须是周日
        结束于: "2022-9-10"
    },
    节假日: {
        劳动节: {
            开始于: "2022-4-30",
            结束于: "2022-5-4",
            调休: [
                "2022-4-24",
                "2022-5-7"
            ]
        },
        端午节: {
            开始于: "2022-6-3",
            结束于: "2022-6-5"
        }
    }
});